Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If you submit a patch, you should add your name to this file as part of the patch.
es_es: Si envía una revisión, debe agregar su nombre a este archivo como parte de la revisión.

source: perltodo Perl things to do
es_es: perltodo Tareas pendientes

source: The approach taken is analogous to the existing space optimisation for subroutine stub declarations, which are stored as plain scalars in place of the full typeglob.
es_es: El enfoque adoptado es análogo a la optimización del espacio existente para las declaraciones básicas de subrutinas, que son almacenadas como escalares normales en lugar del typeglob completo.

source: =item formline PICTURE,LIST X<formline>
es_es: =item formline CUADRO,LISTA X<formline>

source: If the source number can be represented in the target form, that representation is used.
es_es: Si el número de origen se puede representar en la forma de destino, se usa esa representación.

source: You might try to write that as
es_es: Puede tratar de escribirlo como

source: C<Encode> upgraded to version 2.12
es_es: C<Encode> actualizado a la versión 2.12

source: If you're hacking on the Perl core, this will help you find what you're looking for.
es_es: En él encontrará toda la información necesaria para «hackear» el núcleo de Perl.

source: If EXPR is omitted, unpacks the C<$_> string.
es_es: Si EXPR es omitido, desempaqueta la cadena C<$_>.

source: It's best to assume traditional behavior if you're writing portable programs.
es_es: Es mejor asumir el comportamiento tradicional si está escribiendo programas portables.

source: =item Testing tools
es_es: =item Herramientas de prueba

source: my $animal = "camel";
es_es: my $animal = "camello";

source: You can switch into a package in more than one place, since this only determines which default symbol table the compiler uses for the rest of that block.
es_es: Usted puede cambiar en un paquete en más de un lugar, ya que esto sólo determina qué tabla de símbolos por defecto será utilizada por el compilador para el resto de ese bloque.

source: Example: [a-z] matches "a" or "b" or "c" ... or "z"
es_es: Ejemplo: [a-z] coincide con "a" o "b" o "c" ... o "z"

source: If an uncaught exception results in interpreter exit, the exit code is determined from the values of C<$!> and C<$?> with this pseudocode:
es_es: Si se produce una excepción no detectada en la salida del intérprete, el código de salida se determina a partir de los valores de C<$!> y C<$?> con este pseudocódigo:

source: or die "Can't start caesar: $!";
es_es: or die "No puedo iniciar caesar: $!";

source: printf '<%#.5o>', 012; # prints "<00012>"
es_es: printf '<%#.5o>', 012; # imprime "<00012>"

source: Though forcing an argument into a particular form does not change the stored number, Perl remembers the result of such conversions.
es_es: Aunque forzar la conversión de un argumento a un formato específico no cambia el número almacenado, Perl recuerda el resultado de las conversiones.

# print "r is a reference to a hash. ";
source: print "r is a reference to a hash.\n";
es_es: print "r es una referencia a un hash.\n";

source: =item bind SOCKET,NAME X<bind>
es_es: =item bind SOCKET,NOMBRE X<bind>

source: If you add or delete a hash's elements while iterating over it, entries may be skipped or duplicated--so don't do that.
es_es: Si añade o borra un elemento de un hash mientras está iterando sobre él, puede encontrarse con entradas desaparecidas o duplicadas, así que no lo haga.

source: Match 0 or 1 time, not greedily
es_es: Coincide 0 o 1 veces, sin avaricia

source: C<viacode()> now accept hex strings and has been optimized.
es_es: C<viacode()> ahora acepta cadenas hexadecimales y ha sido optimizado.

source: Such literals are accepted by both C<require> and C<use> for doing a version check.
es_es: Estos literales son aceptadas por ambas C<require> y C<use> para hacer una comprobación de versión.

source: Some operators return the last value in the list.
es_es: Algunos operadores devuelven el último valor de la lista.

source: The original string is never changed when C</r> is used.
es_es: La cadena original no se cambia nunca cuando C</r> se utiliza.

source: Type-casting operator.
es_es: Operador de Forzado de tipo.

source: If the C</c> modifier is specified, the SEARCHLIST character set is complemented.
es_es: Si se especifica el modificador C</c>, el conjunto de caracteres LISTA_BÚSQUEDA es complementado.

source: Also note that the final match did not update C<pos>.
es_es: También tenga en cuenta que la última coincidencia no actualizó C<pos>.

source: The result is the character specified by the hexadecimal number in the range 0x00 to 0xFF.
es_es: El resultado es el carácter especificado por el número hexadecimal en el rango 0x00 a 0xFF.

source: The C<:encoding> layer sometimes needs to be called in mid-stream, and it doesn't flush the stream.
es_es: La capa C<:encoding> algunas veces necesita ser llamada en mitad del flujo de datos y no lo vacía.

source: C<threads::shared> upgraded to version 0.94
es_es: C<threads::shared> actualizado a la versión 0.94

source: A character range may be specified with a hyphen, so C<tr/A-J/0-9/> does the same replacement as C<tr/ACEGIBDFHJ/0246813579/>.
es_es: Un intervalo de caracteres se puede especificar con un guión, por lo que C<tr/A-J/0-9/> es la sustitución de C<tr/ACEGIBDFHJ/0246813579/>.

source: Again, for elementary pieces there is no such question, since at most one match at a given position is possible.
es_es: Una vez más, de las piezas elementales no hay cuestión de este tipo, ya que la mayoría coincide en una posición determinada.

source: = += -= *= etc. ? zero or one /g global
es_es: = += -= *= etc. ? cero o una /g global

source: If you wanted to keep track of subscripts, you might do this:
es_es: Si quisiera hacer un seguimiento de los subíndices, podría hacer lo siguiente:

# if (%a_hash) { print "has hash members " }
source: if (%a_hash) { print "has hash members\n" }
es_es: if (%a_hash) { print "el hash tiene miembros\n" }

source: print "We have no bananas" unless $bananas;
es_es: print "No quedan plátanos" unless $platanos;

source: Treat string as single line.
es_es: Trata a la cadena como una sola línea.

source: =item no MODULE VERSION
es_es: =item no MÓDULO VERSIÓN

source: If there's something you need to do, then it's probably already been done, and a working example is usually available for free.
es_es: Cuando se enfrente a un problema, es probable que pueda obtener un ejemplo que funciona (generalmente gratis) de alguien que lo haya hecho ya.

source: =head2 Compound Statements X<statement, compound> X<block> X<bracket, curly> X<curly bracket> X<brace> X<{> X<}> X<if> X<unless> X<while> X<until> X<foreach> X<for> X<continue>
es_es: =head2 Instrucciones compuestas X<statement, compound> X<block> X<bracket, curly> X<curly bracket> X<brace> X<{> X<}> X<if> X<unless> X<while> X<until> X<foreach> X<for> X<continue> X<instrucción, compuesta> X<bloque> X<llave>

source: -k File has sticky bit set.
es_es: -k Archivo tiene puesto el bit sticky.

source: Throughout Perl's documentation, you'll find numerous examples intended to help explain the discussed features.
es_es: En la documentación de Perl se incluyen muchos ejemplos que ilustran las características descritas.

source: The hash code has been refactored to reduce source duplication.
es_es: El código hash ha sido reprogramado para reducir la duplicación de código fuente.

source: means of script invocation.
es_es: para la invocación de I<script>.

source: Perl works on platforms that have a native encoding currently of either ASCII/Latin1 or EBCDIC, each of which allow specification of 256 characters.
es_es: Perl funciona en plataformas que tienen, actualmente, una codificación nativa ASCII/Latin1 o EBCDIC, cada una de las cuales permiten la especificación de 256 caracteres.

source: FILENO this
es_es: FILENO este

source: =head2 Where are the archives for comp.lang.perl.misc?
es_es: =head2 ¿Dónde puedo encontrar los mensajes antiguos de comp.lang.perl.misc?

source: @ones = (5) x @ones; # set all elements to 5
es_es: @unos = (5) x @unos; # pone todos los elementos a 5

source: The form C<while/if BLOCK BLOCK>, available in Perl 4, is no longer available.
es_es: La forma C<while/if BLOQUE BLOQUE>, existente en Perl 4, ya no está disponible.

source: There are a set of utilities which help you in developing Perl programs, and in particular, extending Perl with C.
es_es: A continuación se describe un conjunto de utilidades que ayudan a desarrollar programas Perl y, en particular, a extender Perl con código C.

source: Chat scripts were just drivers for existing programs, not stand-alone programs in their own right.
es_es: Los scripts de chat sólo eran activadores de programas existentes, no programas autónomos por derecho propio.

source: =item Functions obsoleted in perl5
es_es: =item Funciones obsoletas en perl5

source: Moreover, its semantics have been adjusted for greater consistency or usefulness in several cases.
es_es: Por otra parte, su semántica se ha ajustado para que tenga una mayor coherencia y utilidad en algunos casos.

source: Similarly for the C<:encoding> pragma: in that case pretty much any characters can be read.
es_es: Del mismo modo, para el pragma C<:encoding>: en este caso casi todos los caracteres se pueden leer.

source: Many regular expression constructs don't work on EBCDIC platforms.
es_es: Muchas construcciones de expresiones regulares no funcionan en plataformas EBCDIC.

source: Binary "<" returns true if the left argument is numerically less than the right argument.
es_es: Binario "<" devuelve verdadero si el argumento de la izquierda es numéricamente menor que el argumento de la derecha.

source: =head2 Truth and Falsehood X<truth> X<falsehood> X<true> X<false> X<!> X<not> X<negation> X<0>
es_es: =head2 Verdad y Falsedad X<truth> X<falsehood> X<true> X<false> X<!> X<not> X<negation> X<0> X<verdad> X<falsedad> X<verdadero> X<falso> X<negación> X<no>

source: my @greek_small = map { chr } ord "\N{alpha}" ..
es_es: my @griegas_minusculas = map { chr } ord("\N{alpha}" ..

source: If you need to exit the process with a specific exit code, see L</exit>.
es_es: Si necesita terminar el proceso con un valor de salida específico, vea L</exit>.

source: perlre - Perl regular expressions
es_es: perlre - Expresiones regulares en Perl

source: =item C<< (?<NAME>pattern) >> X<< (?<NAME>) >> X<(?'NAME')> X<named capture> X<capture>
es_es: =item C<< (?<NOMBRE>patrón) >> X<< (?<NOMBRE>) >> X<(?'NOMBRE')> X<captura nominada> X<captura>

source: An C<eof> without an argument uses the last file read.
es_es: Un C<eof> sin argumento usa el último archivo leído.

source: "++" and "--" work as in C. That is, if placed before a variable, they increment or decrement the variable by one before returning the value, and if placed after, increment or decrement after returning the value.
es_es: "++" y "--" funcionan como en C. Es decir, si son colocados antes de una variable, incrementan o decrementan la variable por uno antes de devolver el valor, y colocados después, incrementan o decrementan después de haber devuelto el valor.

source: Long lines broken after an operator (except C<and> and C<or>).
es_es: Dividir líneas largas después de un operador (excepto C<and> y C<or>).

source: Read the documentation for the C<filetest> pragma for more information.
es_es: Para más información, lea la documentación del pragma C<filetest>.

source: B<WARNING:> This feature is highly experimental.
es_es: B<ADVERTENCIA:> Esta característica es muy experimental.

source: If you had the entire header of a normal Unix email message in $header, you could split it up into fields and their values this way:
es_es: Si usted tuviera el encabezado completo de un mensaje de correo electrónico Unix normal en $encabezado, puede dividirlo en sus campos y valores de esta manera:

source: Equivalent examples:
es_es: Ejemplos equivalentes:

source: See L<perlvar/%SIG> for details on setting C<%SIG> entries, and L<"eval BLOCK"> for some examples.
es_es: Ver L<perlvar/%SIG> para los detalles sobre cómo colocar entradas C<%SIG> y L<"eval BLOQUE"> para algunos ejemplos.

source: GETC this
es_es: GETC este

source: =head1 BUILD AND INSTALL
es_es: =head1 CONSTRUCCIÓN E INSTALACIÓN

source: Unfortunately when Perl writes to DBM databases it doesn't use NULL termination, so your Perl application will have to manage NULL termination itself.
es_es: Sin embargo, Perl no usa el carácter de terminación NULL al escribir en bases de datos DBM, por lo que la aplicación Perl deberá encargarse de agregar la terminación NULL.

source: The first two elements of the list must be the NUMERIC access and modification times, in that order.
es_es: Los dos primeros elementos de la lista deben ser los tiempos NUMÉRICOS de acceso y de modificación, y en ese orden.

source: See L<assertions> and L<perlrun>.
es_es: Vea L<aserciones> y L<perlrun>.

source: The C<goto-&NAME> form is quite different from the other forms of C<goto>.
es_es: La forma C<goto-&NOMBRE> es muy diferente de las otras formas de C<goto>.

source: Synced with its CPAN version 2.10
es_es: Sincronizado con su versión 2.10 en CPAN

source: $old_filter = $db->filter_fetch_value( sub { ... } );
es_es: $filtro_antiguo = $db->filter_fetch_value( sub { ... } );

source: @whatever = ();
es_es: @loquesea = ();

source: Something pulled the plug on a live tied variable, Perl plays safe by bailing out.
es_es: Algo tiró del enchufe en una variable enlazada que seguía viva, Perl apuesta seguro por el rescate.

# print "Hostname is $2 ";
source: print "Hostname is $2\n";
es_es: print "El nombre del servidor es $2\n";

source: Signals should still be dispatched within the same statement as they were previously - if this is not the case, or it is possible to create uninterruptible loops, this is a bug, and reports are encouraged of how to recreate such issues.
es_es: Las señales aún deben ser despachadas dentro de la instrucción igual que antes - si este no es el caso, o es posible crear bucles sin interrupción, esto es un error, y los informes animan a recrear estas cuestiones.

source: When Perl is configured to use ithreads, it will use re-entrant library calls in preference to non-re-entrant versions.
es_es: Cuando Perl está configurado para usar ithreads, usará llamadas de biblioteca reentrantes preferentemente sobre versiones no-reentrantes.

source: fix unpack U to be the reverse of pack U
es_es: arreglo de unpack("U") para que sea el inverso de pack("U")

source: # sequence, hence the presence of '\\' in the conversion rules.
es_es: # secuencia \\Y|, y de ahí viene la presencia de '\\' en las reglas de conversión.

source: Space after each comma.
es_es: Espacio después de cada coma.

source: The new compilation flag C<PERL_DONT_CREATE_GVSV>, introduced as an option in perl 5.8.8, is turned on by default in perl 5.9.3.
es_es: La nueva opción de compilación C<PERL_DONT_CREATE_GVSV>, presentado como una opción en perl 5.8.8, está activada de forma predeterminada en Perl 5.9.3.

source: You would want to use the list form of the pipe so you can pass literal arguments to the command without risk of the shell interpreting any shell metacharacters in them.
es_es: Querrá usar la forma de lista de la tubería para que pueda pasar argumentos literales al comando sin el riesgo de que el shell interprete cualquier posible metacarácter que hubiera en ellos.

source: =head2 Scalar values X<scalar> X<number> X<string> X<reference>
es_es: =head2 Valores escalares X<scalar> X<number> X<string> X<reference> X<escalar> X<número> X<cadena> X<referencia>

source: =head2 Named Unary Operators X<operator, named unary>
es_es: =head2 Operadores unarios con nombre X<operator, named unary> X<operador, unario con nombre>

source: perl5114delta Perl changes in version 5.11.4
es_es: perl5114delta Cambios en la versión 5.11.4

source: print(" lowercase"), redo LOOP if /\G\p{Ll}+\b[,.;]?\s*/gc;
es_es: print(" minúscula"), redo LOOP if /\G\p{Ll}+\b[,.;]?\s*/gc;

source: If OFFSET is negative then it starts that far from the end of the array.
es_es: Si el DESPLAZAMIENTO es negativo, se cuenta la posición desde el final del array.

source: =item -X DIRHANDLE
es_es: =item -X IDENTIFICADOR_DIR

source: print ++($foo = "zz"); # prints "aaa"
es_es: print ++($foo = "zz"); # imprime "aaa"

source: Binary "!=" returns true if the left argument is numerically not equal to the right argument.
es_es: Binario "!=" devuelve verdadero si el argumento de la izquierda es numéricamente distinto que el argumento de la derecha.

source: unlink("alpha", "beta", "gamma")
es_es: unlink("alfa", "beta", "gamma")

source: cpan.org?
es_es: ¿Y cpan.org?

source: * / % x SYNTAX
es_es: * / % x SINTAXIS

source: A more complete description of how Perl matches the switch variable against the C<when> conditions is given in L<perlsyn/"Switch statements">.
es_es: Una descripción más completa de cómo Perl hace coincidir la variable del switch con las condiciones C<when> se da en L<perlsyn/"Instrucciones switch">.

# 'aaab' =~ /a+b?(*PRUNE)(?{print "$& "; $count++})(*FAIL)/;
source: 'aaab' =~ /a+b?(*PRUNE)(?{print "$&\n"; $count++})(*FAIL)/;
es_es: 'aaab' =~ /a+b?(*PRUNE)(?{print "$&\n"; $contador++})(*FAIL)/;

source: $re = customre::convert $re;
es_es: $re = customre::convertir $re;

source: Of course, typing in your own password to whoever asks you for it is unwise.
es_es: Naturalmente es muy imprudente dar la propia contraseña a cualquiera que lo pregunte.

source: my $foo = 20; # no warning about duplicate my $foo, # but hey, you asked for it!
es_es: my $foo = 20; # no avisa de un my $foo duplicado, # pero bueno, ¡tú lo has querido!

source: =item utime LIST X<utime>
es_es: =item utime LISTA X<utime>

source: comp.lang.perl.moderated Moderated discussion group
es_es: comp.lang.perl.moderated Grupo de discusión moderado

source: This document describes differences between the 5.8.1 release and the 5.8.2 release.
es_es: Este documento describe las diferencias entre la versión 5.8.1 y la versión 5.8.2.

source: This modifier may be specified to be the default by C<use feature 'unicode_strings>, but see L</Which character set modifier is in effect?>.
es_es: Este modificador puede ser especificado para que sea el predeterminado por C<use feature 'unicode_strings'>, pero vea L</¿Qué modificador de conjunto de caracteres está en vigor?>.

source: However, those variables will never be reinitialized, contrary to lexical variables that are reinitialized each time their enclosing block is entered.
es_es: Sin embargo, estas variables no se reinicializan, a diferencia de las variables léxicas que se reinicializan cada vez que entran en un bloque.

source: The old version
es_es: La versión antigua

source: Previous versions of Perl tried to map POSIX style character class definitions onto Unicode property names so that patterns would "dwim" when matches were made against latin-1 or unicode strings.
es_es: Las versiones anteriores de Perl intentaron mapear las definiciones de clase de caracteres del estilo POSIX a los nombres de las propiedades Unicode para que los patrones pudieran "escribirse tal cual" cuando las coincidencias se aplicaban a cadenas latin-1 o Unicode.

source: exec '/bin/echo', 'Your arguments are: ', @ARGV;
es_es: exec '/bin/echo', 'Tus argumentos son: ', @ARGV;

source: Any number of C<(*MARK)> patterns are allowed, and the NAME portion may be duplicated.
es_es: Está permitido cualquier número de patrones C<(*MARK)>, y la parte del NOMBRE puede ser duplicada.

source: open(FOO) or die "Can't open $FOO: $!"; # FOO or bust!
es_es: open(FOO) or die "No puedo abrir $FOO: $!"; # ¡FOO o quieto!

source: make: 1 hour 15 minutes
es_es: make: 1 hora 15 minutos

source: le less than or equal
es_es: le menor o igual que

source: my @nums = @caps = ();
es_es: my @numeros = @mayusculas = ();

source: =head2 Portability X<portability> X<Unix> X<portable>
es_es: =head2 Portabilidad X<portability> X<Unix> X<portable> X<portabilidad>

source: =item substr EXPR,OFFSET,LENGTH,REPLACEMENT X<substr> X<substring> X<mid> X<left> X<right>
es_es: =item substr EXPR,DESPLAZAMIENTO,LONGITUD,REEMPLAZO X<substr> X<substring> X<mid> X<left> X<right>

source: C<perlivp> no longer checks for F<*.ph> files by default.
es_es: C<perlivp>, por defecto, ya no comprueba los archivos F<*.ph>.

source: open(my $fh, "<:encoding(UTF-8)", "filename")
es_es: open(my $fh, "<:encoding(UTF-8)", "archivo")

source: unless (EXPR) BLOCK
es_es: unless (EXPR) BLOQUE

source: with foreword by Randal L. Schwartz
es_es: con prólogo de Randal L. Schwartz

source: (mod_perl 1.x works fine.) You will also need Apache::Test 1.04 or higher.
es_es: (mod_perl 1.x funciona bien.) También necesitará Apache::Test 1.04 o superior.

source: Like C<CLONE>, C<CLONE_SKIP> is called once per package; however, it is called just before cloning starts, and in the context of the parent thread.
es_es: Al igual que C<CLONE>, C<CLONE_SKIP> es llamado una vez por paquete; sin embargo, es llamado justo antes de que comience la clonación, y en el contexto del hilo de ejecución del padre.

source: Adds C<$Text::Wrap::separator2>, which allows you to preserve existing newlines but add line-breaks with some other string.
es_es: Agrega C<$Text::Wrap::separator2>, que le permite preservar los caracteres de nueva línea presentes, pero añade nuevas rupturas de línea usando otras cadenas de caracteres.

source: (The difference is that C does not offer named loops combined with loop control.
es_es: (La diferencia con C es que no ofrece bucles nominales combinados con control de bucles.

source: perlutil utilities packaged with the Perl distribution
es_es: perlutil Utilidades empaquetadas en una distribución Perl

source: Win32 portability fix
es_es: Arreglo en la portabilidad de Win32

source: No one is actively supporting Perl 4.
es_es: Actualmente nadie ofrece soporte para Perl 4 de forma activa.

source: | # or
es_es: | # o

source: # a simpleminded Pascal comment stripper
es_es: # elimina ingenuamente comentarios Pascal

source: "@INC" locations of perl libraries
es_es: "@INC" ubicación de bibliotecas de Perl

source: The author.
es_es: El autor.

source: What's happening is that you've asked "Is it true that at the start of $x, following 0 or more non-digits, you have something that's not 123?" If the pattern matcher had let C<\D*> expand to "ABC", this would have caused the whole pattern to fail.
es_es: Lo que pasa es que usted ha preguntado "¿Es verdad que al principio de $x, después de 0 o más no-dígitos, tiene algo que no es 123?" Si el reconocedor de patrones hubiese dejado que se expandiera C<\D*> a "ABC", habría causado que todo el patrón fallara.

source: Of course, it'll need to be executable first, so C<chmod 755 script.pl> (under Unix).
es_es: Por supuesto, antes deberá marcarlo como ejecutable con el comando C<chmod 755 script.pl> (en Unix).

source: perltru64 Perl notes for Tru64
es_es: perltru64 Notas para Tru64

source: Thus, C<"$foo XXX '@arr'"> becomes:
es_es: Así, C<"$foo XXX '@arr'"> se convierte en:

source: =item rand EXPR X<rand> X<random>
es_es: =item rand EXPR X<rand> X<random> X<aleatorio>

source: =item my TYPE EXPR : ATTRS
es_es: =item my TYPE EXPR : ATRIBUTOS

# or die "Cannot open $filename: $! ";
source: or die "Cannot open $filename: $!\n";
es_es: or die "No se puede abrir $archivo: $!\n";

source: perlfaq6 Regexes
es_es: perlfaq6 Expresiones regulares
